[
    {
        "title": "OZLK IT Ltd.",
        "keywords": [
            "Frontend Developer",
            "May,2025 - Current",
            "London, UK"
        ],
        "style": "left",
        "description": "I am working part-time for the client (Goldwise, UK) admin panel in React, which is used to manage the precious metals trading iOS app. I refactored the legacy code, added new features, and held meetings with the client."
    },
    {
        "title": "Summer",
        "keywords": [
            "Software Consultant",
            "Jul,2024 - August, 2024",
            "New York, USA"
        ],
        "style": "right",
        "description": "Vault was acquired by Summer. I joined on a contract to help in the transition of Vault modules into Summer and support changes in the codebase as required by the team. I worked on immediately required frontend changes and was involved in regular team meetings."
    },
    {
        "title": "Vault",
        "keywords": [
            "Frontend Consultant",
            "October,2023 - June,2024",
            "Texas, USA"
        ],
        "style": "left",
        "description": "Joined as the sole Frontend consultant, I worked on refactoring the React web app codebase and improved the load times. I also made a new admin panel with a modern React stack due to legacy issues and bugs with the older admin panel."
    },
    {
        "title": "Softprodigy",
        "keywords": [
            "Sr. Software Engineer",
            "Dec,2020 - Dec,2023",
            "Mohali, India"
        ],
        "style": "right",
        "description": "Worked on Angular projects for the company's client and then outsourced to CSG after clearing their interview. I was also involved in conducting interviews, managing a team of juniors, and giving tutorials. I joined the Imperial brand project as a contractor after clearing interviews for NextJS."
    },
    {
        "title": "Edustoke",
        "keywords": [
            "Web Developer",
            "Jul,2020 - Nov,2020",
            "Gurugram, India"
        ],
        "style": "left",
        "description": "Worked on the product homepage for improving loading performance by loading scripts dynamically, reworking the UI for a better look and user experience, and experimentation with an online tuition module with open source video conferencing."
    },
        {
        "title": "Bentsys",
        "keywords": [
            "Software Engineer",
            "March,2018 - May,2020",
            "Mohali, India"
        ],
        "style": "right",
        "description": "Joined as GET, learned vanilla JS, HTML, and CSS for starting basic projects. Moved on to the Angular and Vue stack and implemented the company's project within the given deadlines. I focused on core technologies of frontend, worked with Firebase and GCM."
    }
]
